/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Socket closed by remote peer";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "El intento de conectar al host ha caducado";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "El intento de crear socket desde socket FD falló. getpeername () falló.";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Operación de lectura alcanzó el maximo espacio";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "Tiempo de lectura agotado";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "Tiempo de escritura agotado";

